In [13]:
import pandas as pd

In [14]:
# Leyendo el archivo csv
df_familia = pd.read_csv('familia.csv')
df_familia

     Nombres  Edad genero          Trabajo  Años Trabajando
0     Moises    24      M      Programador                1
1    Lluvia     46      F        Repostera               30
2     Aaron     22      M             Chef                2
3      Itzel    28      F          Doctora                5
4    Alberto    26      M     Biotecnologo                3
5     Junuen    27      F  Ing. Industrial                4
6  Francisco    20     M           Locutor                2

# 1 Operaciones

## 1.1 Operaciones en columnas

In [15]:
# Selecciona una columna y calcula la suma total
df_familia['Edad'].sum()

193

In [16]:
# Métodos Contar, promedio, desv. estandar, maximo y minimo
df_familia['Edad'].count()
df_familia['Edad'].mean()
df_familia['Edad'].std()
df_familia['Edad'].max()
df_familia['Edad'].min()

20

In [17]:
# Calcula más rápido con .describe()
df_familia.describe()

            Edad  Años Trabajando
count   7.000000         7.000000
mean   27.571429         6.714286
std     8.599557        10.355583
min    20.000000         1.000000
25%    23.000000         2.000000
50%    26.000000         3.000000
75%    27.500000         4.500000
max    46.000000        30.000000

## 1.2 Operaciones en filas

In [20]:
# Calcula la suma en una fila
df_familia['average'] = df_familia['Edad'] + df_familia['Años Trabajando']
df_familia

     Nombres  Edad genero          Trabajo  Años Trabajando  average
0     Moises    24      M      Programador                1       25
1    Lluvia     46      F        Repostera               30       76
2     Aaron     22      M             Chef                2       24
3      Itzel    28      F          Doctora                5       33
4    Alberto    26      M     Biotecnologo                3       29
5     Junuen    27      F  Ing. Industrial                4       31
6  Francisco    20     M           Locutor                2       22

In [ ]:
# Calcular el Score promedio y asignar los resultados a una nueva columna